{
  "architectures": [
    "LlavaForConditionalGeneration"
  ],
  "image_seq_length": 729,
  "image_token_index": 128077,
  "model_type": "llava",
  "multimodal_projector_bias": true,
  "projector_hidden_act": "gelu",
  "text_config": {
    "_name_or_path": "meta-llama/Llama-3.1-8B-Instruct",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": [
      128001,
      128008,
      128009
    ],
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
      "factor": 8.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_type": "llama3"
    },
    "rope_theta": 500000.0,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 128256
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0.dev0",
  "vision_config": {
    "_name_or_path": "google/siglip2-so400m-patch14-384",
    "architectures": [
      "SiglipVisionModel"
    ],
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 384,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "patch_size": 14,
    "torch_dtype": "bfloat16"
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "full"
}
